<a href="https://colab.research.google.com/github/doublejone831/COLAB/blob/main/practice1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [5]:
data = pd.read_csv('/content/drive/MyDrive/Pandas/tutorial data/대한민국_주요_도시_인구수.csv')
data

   도시      인구수
0  서울  9741381
1  부산  3416918
2  인천  2925967
3  대구  2453041
4  대전  1525849
5  광주  1496172
6  수원  1193894
7  울산  1147037
8  고양  1068641
9  용인  1061440

In [8]:
data.shape #자료의 행과 열을 출력

(10, 2)

In [9]:
data.head(3) #위에서부터 3개 행의 data출력

   도시      인구수
0  서울  9741381
1  부산  3416918
2  인천  2925967

In [10]:
data.tail(3) # 밑에서 부터 3개 행의 data출력

   도시      인구수
7  울산  1147037
8  고양  1068641
9  용인  1061440

In [11]:
data.info() #dataframe의 정보

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   도시      10 non-null     object
 1   인구수     10 non-null     int64
dtypes: int64(1), object(1)
memory usage: 288.0+ bytes

In [12]:
data['도시'] # dataframe뒤에 대괄호를 붙이고 column명을 입력하여 해당 column만을 호출

0    서울
1    부산
2    인천
3    대구
4    대전
5    광주
6    수원
7    울산
8    고양
9    용인
Name: 도시, dtype: object

In [13]:
data.도시 #또는 .column명으로 불러올 수도 있음 But column명에 띄어 쓰기가 있을경우 사용불가능

0    서울
1    부산
2    인천
3    대구
4    대전
5    광주
6    수원
7    울산
8    고양
9    용인
Name: 도시, dtype: object

이하 데이터 프레임 생성하기

In [18]:
city = ['서울','부산','인천','대구','대전','광주','수원','울산','고양','용인']
population = [9741381, 3416918, 2925967, 2453041, 1525849, 1496172, 1193894, 1147037, 1068641, 1061440]

In [16]:
data = pd.DataFrame(columns = ['도시', '인구수'], index=range(10))
data #데이터 없는 dataFrame생성

    도시  인구수
0  NaN  NaN
1  NaN  NaN
2  NaN  NaN
3  NaN  NaN
4  NaN  NaN
5  NaN  NaN
6  NaN  NaN
7  NaN  NaN
8  NaN  NaN
9  NaN  NaN

In [19]:
#리스트의 정보를 dataframe으로 불러오기
data['도시'] = city
data['인구수'] = population
data

   도시      인구수
0  서울  9741381
1  부산  3416918
2  인천  2925967
3  대구  2453041
4  대전  1525849
5  광주  1496172
6  수원  1193894
7  울산  1147037
8  고양  1068641
9  용인  1061440

In [20]:
#dictionary를 이용해 dataFrame생성
data_dict = {'도시' : city, '인구수':population}
data = pd.DataFrame(data_dict)
data

   도시      인구수
0  서울  9741381
1  부산  3416918
2  인천  2925967
3  대구  2453041
4  대전  1525849
5  광주  1496172
6  수원  1193894
7  울산  1147037
8  고양  1068641
9  용인  1061440

In [23]:
#DataFrame을 CSV로 저장 (to_csv이용)
directory = '/content/drive/MyDrive/Pandas/tutorial data/data02.csv'
data.to_csv(directory)
pd.read_csv(directory)
#unnamed column은 인덱스또한 저장하게 되면서 생긴 오류 
#저장시 뒤에 인자에 index = False를 추가하여 인덱스를 저장하지 않을수 있음.

   Unnamed: 0  도시      인구수
0           0  서울  9741381
1           1  부산  3416918
2           2  인천  2925967
3           3  대구  2453041
4           4  대전  1525849
5           5  광주  1496172
6           6  수원  1193894
7           7  울산  1147037
8           8  고양  1068641
9           9  용인  1061440

In [25]:
directory = '/content/drive/MyDrive/Pandas/tutorial data/data002.csv'
data.to_csv(directory, index = False)
pd.read_csv(directory)

   도시      인구수
0  서울  9741381
1  부산  3416918
2  인천  2925967
3  대구  2453041
4  대전  1525849
5  광주  1496172
6  수원  1193894
7  울산  1147037
8  고양  1068641
9  용인  1061440

기존 DATAFrame에 column과 row 추가

In [26]:
man = [4757642, 1680933, 1472081, 1218326, 765718, 745122, 601097, 589233, 523803, 526824]
woman = [4984229, 1735985, 1453886, 1234715, 760131, 751050, 592797, 557804, 544838, 534617]
data['남자'] = man
data['여자'] = woman
data

   도시      인구수       남자       여자
0  서울  9741381  4757642  4984229
1  부산  3416918  1680933  1735985
2  인천  2925967  1472081  1453886
3  대구  2453041  1218326  1234715
4  대전  1525849   765718   760131
5  광주  1496172   745122   751050
6  수원  1193894   601097   592797
7  울산  1147037   589233   557804
8  고양  1068641   523803   544838
9  용인  1061440   526824   534617

In [27]:
data.sum() #각 column들의 총합을 구하는 함수

도시     서울부산인천대구대전광주수원울산고양용인
인구수                26030340
남자                 12880779
여자                 13150052
dtype: object

In [28]:
#row 추가시에는 저장할 row를 loc의 인자로 넣어주고 거기에 넣어줄 데이터를 넣으면 된다
data.loc[10] = data.sum();
data

                      도시       인구수        남자        여자
0                     서울   9741381   4757642   4984229
1                     부산   3416918   1680933   1735985
2                     인천   2925967   1472081   1453886
3                     대구   2453041   1218326   1234715
4                     대전   1525849    765718    760131
5                     광주   1496172    745122    751050
6                     수원   1193894    601097    592797
7                     울산   1147037    589233    557804
8                     고양   1068641    523803    544838
9                     용인   1061440    526824    534617
10  서울부산인천대구대전광주수원울산고양용인  26030340  12880779  13150052

In [29]:
#특정 위치를 지정하여 수정 => loc로 지정
data.loc[10, '도시'] = '총합'
data

    도시       인구수        남자        여자
0   서울   9741381   4757642   4984229
1   부산   3416918   1680933   1735985
2   인천   2925967   1472081   1453886
3   대구   2453041   1218326   1234715
4   대전   1525849    765718    760131
5   광주   1496172    745122    751050
6   수원   1193894    601097    592797
7   울산   1147037    589233    557804
8   고양   1068641    523803    544838
9   용인   1061440    526824    534617
10  총합  26030340  12880779  13150052

In [31]:
directory = '/content/drive/MyDrive/Pandas/tutorial data/data03.csv'
data.to_csv(directory, index = False)